Repository: lamoud/bzzix-restrictive-categories
Catalog: lang/bzzix-restrictive-categories-*.po
Languages: ar

source: Restrictive categories
ar: تقييد النشر

source: Settings
ar: إعدادات

source: Access Restriction Settings
ar: إعدادات تقييد الوصول

source: Configure how access to categories is restricted. You can choose to restrict access based on user roles or specific users.
ar: تكوين النشر في التصنيفات. يمكنك اختيار تقييد الوصول بناءً على أدوار المستخدمين أو مستخدمين محددين.

source: Restriction Method
ar: طريقة التقييد

source: Select whether you want to restrict access to categories by specific users or user roles.
ar: حدد ما إذا كنت ترغب في تقييد النشر في التصنيفات من قبل مستخدمين محددين أو أدوار مستخدمين محددين.

source: Restrict by Specific Users
ar: التقييد باستخدام مستخدمين محددين

source: Restrict by User Roles
ar: التقييد باستخدام الصلاحيات

source: User-Based Restrictions
ar: تقيد المستخدمين

source: Restrict access to specific users by entering their user IDs. Users listed here will be prevented from accessing the selected categories.
ar: قم بتقييد الوصول لمستخدمين محددين عن طريق إدخال معرفات المستخدم الخاصة بهم. سيتم منع المستخدمين المدرجين هنا من الوصول إلى التصنيفات الغير محددة لهم.

source: Restricted User IDs
ar: معرفات المستخدم (IDS ) المقيدة

source: Enter the user IDs (separated by commas) of the users who should be restricted. Example: 1,2,34.
ar: أدخل معرفات المستخدم (مفصولة بفواصل) للمستخدمين الذين يجب تقييدهم. مثال: 1،2،34.

source: Role-Based Restrictions
ar: تقييد الصلاحيات

source: Restrict access to entire user roles. Users assigned to the selected roles will be denied access to the restricted categories.
ar: تقييد الوصول إلى صلاحية المستخدم بالكامل. سيتم رفض وصول المستخدمين المعينين للصلاحيات المحددة إلى التصنيفات المقيدة.

source: Restricted Roles
ar: الصلاحيات المقيدة

source: Select the roles that should be restricted from accessing certain categories.
ar: حدد الصلاحيات التي يجب منعها من الوصول إلى تصنيفات معينة.

source: Setting up publishing restrictions
ar: إعداد تقييدات النشر

source: Save Settings
ar: حفظ الإعدادات

source: Category Restrictions
ar: تقييد التصنيفات

source: Allowed Categories
ar: التصنيفات المسموح النشر بها

source: Select the categories this user is allowed to post in.
ar: حدد الصلاحيات المسموح للمستخدم النشر فيها

source: You are not allowed to publish in these categories. Please choose only from the allowed categories.
ar: غير مسموح لك النشر في هذه التصنيفات. يرجى الاختيار من التصنيفات المسموح بها فقط.
